@lechnerc77  OK, so the exact repro:

* Running TF plan, I see "no changes"
* I add this resource block to my module:

```tf
resource "btp_subaccount_environment_instance" "cloudfoundry_abap" {
  subaccount_id    = btp_subaccount.abap.id
  name             = "SCT_Software_abapsystem"
  environment_type = "cloudfoundry"
  service_name     = "cloudfoundry"
  plan_name        = "standard"
  landscape_label  = "cf-${var.abap_environment_region}"

  parameters = jsonencode({
    instance_name = "SCT_Software_abapsystem",
    landscapeLabel = "cf-${var.abap_environment_region}"
    users = [
      {
        email = "REDACTED@sctsoftware.com"
      },
    ]
  })
}```

I add this import statement to my root module:

```tf
import {
  to = module.product_environment.module.product_environment_btp.btp_subaccount_environment_instance.cloudfoundry_abap
  id = "REDACTED_ORG_ID,REDACTED_INSTANCE_ID"
}
```

After making these changes, when I run `terraform plan` again, I see:

```tf
 # module.product_environment.module.product_environment_btp.btp_subaccount_environment_instance.cloudfoundry_abap will be updated in-place
  # (imported from "6897d5a9-6e5f-4978-9ddd-d619d62e370c,5E8CE958-CE5D-4C70-84F2-C32D1D00E501")
  ~ resource "btp_subaccount_environment_instance" "cloudfoundry_abap" {
      ~ broker_id        = "E181A0CD-B424-4D07-87DA-0767EF912337" -> (known after apply)
      ~ created_date     = "2023-01-01T19:56:27Z" -> (known after apply)
      ~ custom_labels    = {} -> (known after apply)
      + dashboard_url    = (known after apply)
      + description      = (known after apply)
        environment_type = "cloudfoundry"
        id               = "5E8CE958-CE5D-4C70-84F2-C32D1D00E501"
      ~ labels           = jsonencode(
            {
              - "API Endpoint"     = "https://api.cf.us10.hana.ondemand.com"
              - "Org ID"           = "2bc5166d-53c1-4494-9e17-9ae787c6f782"
              - "Org Memory Limit" = "204,800MB"
              - "Org Name"         = "SCT_Software_abapsystem"
            }
        ) -> (known after apply)
        landscape_label  = "cf-us10"
      ~ last_modified    = "2023-09-04T12:28:28Z" -> (known after apply)
        name             = "SCT_Software_abapsystem"
      ~ operation        = "provision" -> (known after apply)
      ~ parameters       = jsonencode( # whitespace changes
            {
                instance_name  = "SCT_Software_abapsystem"
                landscapeLabel = "cf-us10"
                users          = [
                    {
                        email = "dhenig@sctsoftware.com"
                    },
                ]
            }
        )
      ~ plan_id          = "fc5abe63-2a7d-4848-babf-f63a5d316df1" -> (known after apply)
        plan_name        = "standard"
      ~ platform_id      = "2bc5166d-53c1-4494-9e17-9ae787c6f782" -> (known after apply)
      ~ service_id       = "fa31b750-375f-4268-bee1-604811a89fd9" -> (known after apply)
        service_name     = "cloudfoundry"
      ~ state            = "OK" -> (known after apply)
        subaccount_id    = "6897d5a9-6e5f-4978-9ddd-d619d62e370c"
      ~ tenant_id        = "6897d5a9-6e5f-4978-9ddd-d619d62e370c" -> (known after apply)
      ~ type             = "Provision" -> (known after apply)
    }

Plan: 1 to import, 0 to add, 1 to change, 0 to destroy.
```

The concerns I have are that:

* It seems like it will possibly modify the resource, which I'd want to avoid, and in ways that I don't know exactly what they'll be.
* It seems like it will remove the labels, but it doesn't seem like that's a desired outcome.